app/views/users/show.html.erb

SELECT "photos".* FROM "photos" WHERE "photos"."user_id" = ?  [["user_id", 2]]
---

<% @user_elem.photos.each() do |p| %>

SELECT "tags".* FROM "tags" WHERE "tags"."photo_id" = 4
---
				<!-- DRAW PHOTO TAGS -->
				<% @tags = Tag.where(:photo_id => p.id) %>

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]
---
						<% @width = t.width %>
						<% @name = User.find(t.user_id).full_name %>

SELECT "comments".* FROM "comments" WHERE "comments"."photo_id" = ?  [["photo_id", 5]]
---
		<% end %>
		<tr><td> <%= link_to "Comment", photo_path([p.id, "/comments/new"].join('')) %> </td></tr>