app/controllers/comments_controller.rb

	def index()
		@comment_list 	= Comment.find_by_photo_id(params[:photo_id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."photo_id" = 6 LIMIT 1

	def new()
		@photo 		= Photo.find(params[:photo_id])
---
SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", "6"]]

	def create()
		# GET PARAMTERS
		@text 		= params[:comment][:text]
		@user 		= session[:user_session]
		@photo 		= Photo.find(params[:photo_id])
		@date_time	= Time.current
		@url		= params[:url]

		if not @text.empty? then
			# MAKE PHOTO OBJECT
			@comment 		= Comment.new(:date_time => @date_time, :comment => @text)
	    	@comment.user 	= @user
	    	@comment.photo 	= @photo

	    	# REDICRECT
	    	if not @comment.save(:validate => true) then
---
SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", "6"]]
INSERT INTO "comments" ("comment", "created_at", "date_time", "photo_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)