app/controllers/photos_controller.rb

INSERT INTO "photos" ("created_at", "date_time", "file_name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)
---
	def create()
		if params[:new_photo] != nil then
			# CREATE IMAGE ATTRIBUTES
			@file_name	= params[:new_photo][:photo].original_filename
			@file 		= params[:new_photo][:photo].read
			@user 		= session[:user_session]
			@date_time	= Time.current

			# STORE IMAGE INFO IN DB
			@new_photo = Photo.new(:date_time => @date_time, :file_name => @file_name)
			@new_photo.user = @user
			if not @new_photo.save(:validate => true) then