app/controllers/tags_controller.rb

SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", "4"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]
INSERT INTO "tags" ("created_at", "date_time", "height", "left", "photo_id", "top", "updated_at", "user_id", "width") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def create()
		@pic_id = ["pic", params[:photo_id]].join('')
		if params[@pic_id] != nil && session[:user_session] != nil then
			@top 	= params[@pic_id][:tagTop]
			@left 	= params[@pic_id][:tagLeft]
			@height = params[@pic_id][:tagHeight]
			@width	= params[@pic_id][:tagWidth]
			@user	= params[@pic_id][:id]
			@date_time	= Time.current
			@photo 		= Photo.find(params[:photo_id])
			@user_name	= User.find(@user).full_name
			@url		= params[:url]

			@tag_new = Tag.new(:photo_id => @photo.id, :user_id => @user, :top => @top, :left => @left, :width => @width, :height => @height, :date_time => @date_time)
	    	if not @tag_new.save(:validate => true) then