app/controllers/users_controller.rb

	def show()
		@page_name = "CS 142 - Project 7"
		@page_msg = "User Records Page"
		@user_elem = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]

	def post_login()
		@username = params[:user][:login]
		@password = params[:user][:password]
		@user_login = User.find_by_login(@username)
---
SELECT "users".* FROM "users" WHERE "users"."login" = 'hilton' LIMIT 1

	def find_user_name(ident)
		@user_elem = User.find(ident)
		@user_name = [@user_elem.first_name, @user_elem.last_name].reject(&:empty?).join(' ')
---
SELECT "users".* FROM "users"

	def search()
		# @q = params[:srch][:text]
		@q = params[:qry]
		puts @q
		# @search_val = User.find_by_sql("SELECT last_name FROM users WHERE last_name LIKE \"%Obama%\";")
		@search_val = Photo.joins(:comments).select("photos.file_name, photos.user_id").where("comment LIKE ?", "%" + @q + "%")
---
SELECT photos.file_name, photos.user_id FROM "photos" INNER JOIN "comments" ON "comments"."photo_id" = "photos"."id" WHERE (comment LIKE '%[%')